fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ВКМ_МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОклада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПроцентОтРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОтпускных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <predefined>
    <items>
      <name>ВКМ_Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ВКМ_ПроцентОтРабот</name>
      <description>Процент от работ</description>
    </items>
    <items>
      <name>ВКМ_Отпускные</name>
      <description>Отпускные</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	ДатаРасчета = ?(ЗначениеЗаполнено(ВКМ_МесяцНачисления), ВКМ_МесяцНачисления, Дата);
	НачалоПериода = НачалоМесяца(ДатаРасчета);
	КонецПериода  = КонецМесяца(ДатаРасчета);
	
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаСотрудника.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		УсловияОплаты = ВКМ_ПолучитьУсловияОплатыСотрудника(СтрокаСотрудника.Сотрудник, КонецПериода);
		Если Не УсловияОплаты.ЕстьУсловия Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для сотрудника " + СтрокаСотрудника.Сотрудник + " не заданы условия оплаты.";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		Оклад = УсловияОплаты.Оклад;
		СуммаОтРабот = ВКМ_ПолучитьСуммуОтРаботЗаПериод(СтрокаСотрудника.Сотрудник, НачалоПериода, КонецПериода);
		Отпускные = 0;
		Начислено = Оклад + СуммаОтРабот + Отпускные;
		НДФЛ = Окр(Начислено * 0.13, 2);
		КВыплате = Начислено - НДФЛ;
		
		СтрокаСотрудника.СуммаОклада = Оклад;
		СтрокаСотрудника.СуммаПроцентОтРабот = СуммаОтРабот;
		СтрокаСотрудника.СуммаОтпускных = Отпускные;
		СтрокаСотрудника.СуммаНачислено = Начислено;
		СтрокаСотрудника.СуммаНДФЛ = НДФЛ;
		СтрокаСотрудника.СуммаКВыплате = КВыплате;
		
		ДвижениеОсн = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ДвижениеОсн.ПериодРегистрации = Дата;
		ДвижениеОсн.Сотрудник = СтрокаСотрудника.Сотрудник;
		ДвижениеОсн.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад;
		ДвижениеОсн.Результат = Оклад;
		
		Если СуммаОтРабот <> 0 Тогда
			ДвижениеОсн = Движения.ВКМ_ОсновныеНачисления.Добавить();
			ДвижениеОсн.ПериодРегистрации = Дата;
			ДвижениеОсн.Сотрудник = СтрокаСотрудника.Сотрудник;
			ДвижениеОсн.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_ПроцентОтРабот;
			ДвижениеОсн.Результат = СуммаОтРабот;
		КонецЕсли;
		
		Если НДФЛ <> 0 Тогда
			ДвижениеУдерж = Движения.ВКМ_Удержания.Добавить();
			ДвижениеУдерж.ПериодРегистрации = Дата;
			ДвижениеУдерж.Сотрудник = СтрокаСотрудника.Сотрудник;
			ДвижениеУдерж.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
			ДвижениеУдерж.Результат = НДФЛ;
		КонецЕсли;
		
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.Период = Дата;
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.Сотрудник = СтрокаСотрудника.Сотрудник;
		ДвижениеВзаиморасчеты.Сумма = КВыплате;
		
	КонецЦикла;
	
КонецПроцедуры
Функция ВКМ_ПолучитьУсловияОплатыСотрудника(Сотрудник, ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Условия.Оклад КАК Оклад,
	|	Условия.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|		&ДатаСреза,
	|		Сотрудник = &Сотрудник) КАК Условия";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ЕстьУсловия, Оклад, ПроцентОтРабот", Истина, Выборка.Оклад, Выборка.ПроцентОтРабот);
	КонецЕсли;
	
	Возврат Новый Структура("ЕстьУсловия, Оклад, ПроцентОтРабот", Ложь, 0, 0);
	
КонецФункции
Функция ВКМ_ПолучитьСуммуОтРаботЗаПериод(Сотрудник, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Обороты.ВКМ_СуммаКОплатеОборот), 0) КАК СуммаОтРабот
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
	|		&НачалоПериода,
	|		&КонецПериода,
	|		,
	|		Сотрудник = &Сотрудник) КАК Обороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОтРабот;
	КонецЕсли;
	
	Возврат 0;
КонецФункции
